#########################
# 例題１
#########################
saving = 1300
apple_price = 120
p saving / apple_price

#########################
# 類題１
#########################
saving = 1300
apple_price = 120
p saving % apple_price

#########################
# 例題２
#########################
total_apples = 357
max_in_box = 15
p total_apples % max_in_box == 0 ? total_apples / max_in_box : total_apples / max_in_box + 1

#########################
# 類題２
#########################
student = 211
max_in_buth = 28
p student % max_in_buth == 0 ? student / max_in_buth : student / max_in_buth + 1

#########################
# 例題３
#########################
# 1 ~ 200のうち、7の倍数の数
p 200 / 7

#########################
# 類題３
#########################
p 500 / 10

#########################
# 例題４
#########################
p (201..300).count{ _1 % 11 == 0 }

#########################
# 類題４
#########################
p (55..555).count{_1%11==0}
p (55..555).count{|i| i % 11 == 0}
