#########################
# 練習問題１
#########################
a, b = gets.split.map(&:to_i)
p a + b

#########################
# 練習問題２
#########################
a, b = gets.split.map(&:to_i)
p a - b

#########################
# 練習問題３
#########################
a, b = gets.split.map(&:to_i)
p a * b

#########################
# 練習問題４
#########################
a, b = gets.split.map(&:to_i)
p b / a

p gets.split.map(&:to_i).reverse.inject(&:/)

#########################
# 練習問題５
#########################
a, b, c, d = gets.split.map(&:to_i)
p a * c + b * d
