# 「数字の全探索」は、特定の範囲の数をすべて調べ上げる

#########################
# 自分の回答
#########################
n = gets.to_i
count = 0
(1..n).each do |n|
  unless n % 2 == 0 || n % 3 == 0 || n % 5 == 0
    count += 1
  end
end
puts count

#########################
# 別解_1
#########################
count = 0
(1..gets.to_i).each { |i| count += 1 if i % 2 != 0 && i % 3 != 0 && i % 5 != 0 }
puts count

#########################
# 別解_2
#########################
count=0
# uptpは、self から 引数 まで 1 ずつ増やしながら繰り返す。
1.upto(gets.to_i){|n|
  if n % 2 != 0 && n % 3 != 0 && n % 5 != 0
    count+=1
  end
}
puts count

#########################
# 別解_3
#########################
# Enumerable#select
# → 各要素に対してブロックを評価した値が真であった要素を全て含む配列を返します。
p (1..gets.to_i).select{|i| i % 2 != 0 && i % 3 != 0 && i % 5 != 0}.length
p (1..gets.to_i).select{ _1 % 2 != 0 && _1 % 3 != 0 && _1 % 5 != 0 }.size

